import React from 'react'
import { Collapse } from 'antd'
const { Panel } = Collapse;
const FAQ = () => {
    return (
        <div className="block faqBlock">
            <div className="faq-heading layoutSection">
                <div class="layoutSection__title">FAQ</div>
                <a class="faq-heading"
                    href="mailto:satelnext7@gmail.com">
                    <svg width="24" height="24" color="white">
                        <svg id="knfxIc-user" viewBox="0 0 20 20" stroke="none" fill="white">
                            <path d="M7.50004 11.6667C5.19885 11.6667 3.33337 13.5321 3.33337 15.8333C3.33337 17.214 4.45266 18.3333 5.83337 18.3333H14.1667C15.5474 18.3333 16.6667 17.214 16.6667 15.8333C16.6667 13.5321 14.8012 11.6667 12.5 11.6667H7.50004Z"></path>
                            <path d="M10 1.66666C7.69885 1.66666 5.83337 3.53214 5.83337 5.83332C5.83337 8.13451 7.69885 9.99999 10 9.99999C12.3012 9.99999 14.1667 8.13451 14.1667 5.83332C14.1667 3.53214 12.3012 1.66666 10 1.66666Z"></path>
                        </svg>
                    </svg>
                    <span>Contact Support</span>
                </a>
            </div>
            <div className="container-fluider">
                <Collapse defaultActiveKey={['1']} >
                    <Panel header="Що таке Clothes Store?" key="1">
                        <p>Наш сайт це комплекс онлайн-магазину, на якому ви можете дивитися, вибирати, а також купувати речі.</p>
                    </Panel>
                    <Panel header="Яка кількість товарів може бути в замовленні?" key="2">
                        <p>В одне замовлення можна додати до 10 одиниць товарів.</p>
                    </Panel>
                    <Panel header="Які умови доставки?" key="3">
                        <p>Ми відправляємо товари по всій Україні.
                            <p>Доступні варіанти доставки:</p>
                            <p> У відділення Нової Пошти</p>
                            <p>У відділення Justin</p>
                            <p>У відділення УкрПошти</p>
                            <p>Кур'єрська доставка за адресою</p>
                        </p>
                    </Panel>
                    <Panel header="Варіанти оплати" key="4">
                        <p>Метод оплати:</p>
                        <p>Доставка у відділення кур'єрських служб - Передплата на сайті	VISA, Mastercard, Apple Pay, Google Pay</p>
                        <p>Доставка у відділення кур'єрських служб - Оплата при отриманні
                            Готівка
                            VISA, Mastercard – у разі наявності терміналу у відділенні</p>
                        <p>Кур'єрська доставка - Передплата на сайті	VISA, Mastercard, Apple Pay, Google Pay</p>
                        <p>Кур'єрська доставка - Оплата при отриманні
                            Готівка
                            VISA, Mastercard</p>

                    </Panel>
                    <Panel header="Де дізнатися про майбутні релізи?" key="5">
                        <p>Стеж за новинами і новими запусками, підписавшись на e-mail розсилку.</p>
                    </Panel>
                    <Panel header="Як мені вибрати правильний розмір?" key="6">
                        <p>У кожній картці товару є індивідуальна таблиця відповідності розмірів.</p>
                    </Panel>
                    <Panel header="Що дає реєстрація на сайті?" key="7">
                        <p>Реєстрація на сайті дає безліч переваг:</p>
                        <p>знижку 10% на перше замовлення за підписку;</p>
                        <p>доступ до ексклюзивних знижок, спеціальних пропозицій і акцій;</p>
                        <p>швидке оформлення замовлення, завдяки можливості зберігати адреси доставки;</p>
                        <p>можливість додавати товари в «Обране».</p>
                    </Panel>
                    <Panel header="Як переконатися в достовірності товару?" key="8">
                        <p>Найкращий спосіб переконатися, що товар справжній — замовити його на clothesstore або придбати в нашій роздрібній мережі.</p>
                    </Panel>
                    <Panel header="Чи можу я змінити замовлення після оформлення?" key="9">
                        <p>Ми прагнемо доставляти наші замовлення якомога швидше. Для цього всі замовлення обробляються автоматично. Тому ми не зможемо змінити адресу, спосіб доставки або оплати і комплектацію замовлення (розмір, колір, артикул тощо). Однак ти можеш скасувати замовлення і оформити заново, вказавши коректні дані.</p>
                    </Panel>
                    <Panel header="Як скасувати замовлення?" key="10">
                        <p>Ти можеш повністю скасувати замовлення протягом 30 хвилин після створення.</p>
                        <p>Для скасування замовлення слідуй крокам:</p>
                        <p>ЗАПОВНИ ФОРМУ</p>
                        <p>введи номер замовлення та e-mail адресу, вказану при оформленні замовлення</p>
                        <p>вибери причину і підтвердь скасування, натиснувши на кнопку «Надіслати».</p>
                    </Panel>
                    <Panel header="Як працює партнерська програма?" key="11">
                        <p>Запросіть друзів та отримуйте 3% від кожної зробленої ними оплату.</p>
                    </Panel>
                </Collapse>
            </div>
        </div>
    )
}

export default FAQ
